Documentation (html)/Protokolle/nanids-protokoll.org
#+title: Protokoll


* Total time:
2 Tage, 18 Stunden und 58 minuten oder *66h 58min*.

Die Zeit ist händisch gestoppt und maschinell zusammengerechnet, bedeutet es ist nicht 100% genau.
Außerdem habe ich erst ab dem [[<2025-02-04 Di>]] angefangen sie zu stoppen.

* <2025-01-22 Do>
Github repository erstellt für collobaration.
Erste Planung in der Freistunde.

commit hash: dabdc03

* <2025-01-25 So>
Erster Versuch an dem Stringparser.

commit hash: 51013ff

* <2025-01-27 Di>
Habe das parsen von equations mit klammern gefixt.

commit hash: 4d26fbf

* <2025-01-28 Mi>
Kleine Anpassung für einheitlicheren code.
(In EquationNode.java state und value sind jetzt public)

commit hash: a355644

* <2025-01-30 Do>
Wieder Probleme mit klammern gefixt.

commit hash: a838576

* <2025-02-03 Mo>
Überlegen wie special funktionen gehandelt werden sollen.

* <2025-02-04 Di>
Durchbruch mit operator stack.
Anstatt nur auf lastOp limitiert zu sein werden die operatoren in einem Stack gespeichert, um besser auf sie zugreifen zu können.

Habe auch angefangen die Zeit genauer zu loggen.

*Arbeitszeit:*
- [2025-02-04 Di 21:21]--[2025-02-04 Di 22:06] =>  0:45
- [2025-02-04 Di 11:28]--[2025-02-04 Di 13:10] =>  1:42

* <2025-02-05 Mi>
Fertigstellung der groben implementation vom Operator Stack.

*Arbeitszeit:*
- [2025-02-05 Mi 11:27]--[2025-02-05 Mi 13:05] =>  1:38

* <2025-02-06 Do>
Weiter an operator stack gearbeitet.

*Arbeitszeit:*
- [2025-02-06 Do 11:26]--[2025-02-06 Do 13:05] =>  1:39
- [2025-02-06 Do 08:45]--[2025-02-06 Do 09:25] =>  0:40

* <2025-02-10 Mo>
Weiter an operator stack gearbeitet.
- oplevel
- interactiveDemo

*Arbeitszeit:*
- [2025-02-10 Mo 20:18]--[2025-02-10 Mo 21:17] =>  0:59
- [2025-02-10 Mo 10:36]--[2025-02-10 Mo 12:10] =>  1:34

