Documentation (html)/Protokolle/nanids-protokoll.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
  <head>
    <!-- 2025-04-26 Sa 11:09 -->
    <meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1" />
    <title>Protokoll</title>
    <meta name="generator" content="Org Mode" />
  </head>
  <body>
    <div id="content" class="content">
      <h1 class="title">Protokoll</h1>
      <div id="table-of-contents" role="doc-toc">
        <h2>Table of Contents</h2>
        <div id="text-table-of-contents" role="doc-toc">
          <ul>
            <li><a href="#org1995827">Total time:</a></li>
            <li><a href="#org573978b"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-01-22 Mi&gt;</span></span></a></li>
            <li><a href="#org11bc577"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-01-25 Sa&gt;</span></span></a></li>
            <li><a href="#orgae5fc5f"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-01-27 Mo&gt;</span></span></a></li>
            <li><a href="#org959229a"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-01-28 Di&gt;</span></span></a></li>
            <li><a href="#orgb1e654f"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-01-30 Do&gt;</span></span></a></li>
            <li><a href="#org89af6a9"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-02-03 Mo&gt;</span></span></a></li>
            <li><a href="#org53af719"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-02-04 Di&gt;</span></span></a></li>
            <li><a href="#org140569a"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-02-05 Mi&gt;</span></span></a></li>
            <li><a href="#orgbfd7ab4"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-02-06 Do&gt;</span></span></a></li>
            <li><a href="#orga2f2e7f"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-02-10 Mo&gt;</span></span></a></li>
            <li><a href="#orgd868677"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-02-11 Di&gt;</span></span></a></li>
            <li><a href="#orgf0a1395"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-02-12 Mi&gt;</span></span></a></li>
            <li><a href="#org4fa1f38"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-02-13 Do&gt;</span></span></a></li>
            <li><a href="#orgf0d94d3"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-02-15 Sa&gt;</span></span></a></li>
            <li><a href="#org8a30b27"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-02-16 So&gt;</span></span></a></li>
            <li><a href="#orgcbc994f"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-02-17 Mo&gt;</span></span></a></li>
            <li><a href="#org5d3fa9b"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-02-17 Mo&gt;</span></span></a></li>
            <li><a href="#org5e7f311"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-02-27 Do&gt;</span></span></a></li>
            <li><a href="#orge844423"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-03-10 Mo&gt;</span></span></a></li>
            <li><a href="#org7dfdfb1"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-03-11 Di&gt;</span></span></a></li>
            <li><a href="#org2c9256f"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-03-13 Do&gt;</span></span></a></li>
            <li><a href="#org8a9007b"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-03-17 Mo&gt;</span></span></a></li>
            <li><a href="#org0fa17dc"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-03-18 Di&gt;</span></span></a></li>
            <li><a href="#org1bbdaa9"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-03-20 Do&gt;</span></span></a></li>
            <li><a href="#orgd760c04"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-03-23 So&gt;</span></span></a></li>
            <li><a href="#org870183f"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-03-24 Mo&gt;</span></span></a></li>
            <li><a href="#orgc453f8f"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-03-25 Di&gt;</span></span></a></li>
            <li><a href="#org7b85626"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-03-27 Do&gt;</span></span></a></li>
            <li><a href="#org6de799d"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-03-31 Mo&gt;</span></span></a></li>
            <li><a href="#org13d105b"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-01 Di&gt;</span></span></a></li>
            <li><a href="#org45f4a4e"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-02 Mi&gt;</span></span></a></li>
            <li><a href="#orgcbd2e25"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-03 Do&gt;</span></span></a></li>
            <li><a href="#orgec2b04f"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-04 Fr&gt;</span></span></a></li>
            <li><a href="#org842ce5f"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-05 Sa&gt;</span></span></a></li>
            <li><a href="#orgc08b88a"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-07 Mo&gt;</span></span></a></li>
            <li><a href="#org7e0292c"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-08 Di&gt;</span></span></a></li>
            <li><a href="#org3ace078"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-09 Mi&gt;</span></span></a></li>
            <li><a href="#org16f54fd"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-10 Do&gt;</span></span></a></li>
            <li><a href="#org7f22f38"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-12 Sa&gt;</span></span></a></li>
            <li><a href="#org657407d"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-17 Do&gt;</span></span></a></li>
            <li><a href="#orgc373ad4"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-19 Sa&gt;</span></span></a></li>
            <li><a href="#orga18a575"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-20 So&gt;</span></span></a></li>
            <li><a href="#org850eeed"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-21 Mo&gt;</span></span></a></li>
            <li><a href="#org3e72437"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-24 Do&gt;</span></span></a></li>
            <li><a href="#org41efc81"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-25 Fr&gt;</span></span></a></li>
            <li><a href="#orgb20fc81"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-26 Sa&gt;</span></span></a></li>
          </ul>
        </div>
      </div>
      <div id="outline-container-org1995827" class="outline-2">
        <h2 id="org1995827">Total time:</h2>
        <div class="outline-text-2" id="text-org1995827">
          <p>
            2 Tage, 18 Stunden und 58 minuten oder <b>66h 58min</b>.
          </p>

          <p>
            Die Zeit ist händisch gestoppt und maschinell zusammengerechnet, bedeutet es ist nicht 100% genau.
            Außerdem habe ich erst ab dem <a href="#org53af719"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-02-04 Di&gt;</span></span></a> angefangen sie zu stoppen.
          </p>
        </div>
      </div>
      <div id="outline-container-org573978b" class="outline-2">
        <h2 id="org573978b"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-01-22 Mi&gt;</span></span></h2>
        <div class="outline-text-2" id="text-org573978b">
          <p>
            Github repository erstellt für collobaration.
            Erste Planung in der Freistunde.
          </p>

          <p>
            commit hash: dabdc03
          </p>
        </div>
      </div>
      <div id="outline-container-org11bc577" class="outline-2">
        <h2 id="org11bc577"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-01-25 Sa&gt;</span></span></h2>
        <div class="outline-text-2" id="text-org11bc577">
          <p>
            Erster Versuch an dem Stringparser.
          </p>

          <p>
            commit hash: 51013ff
          </p>
        </div>
      </div>
      <div id="outline-container-orgae5fc5f" class="outline-2">
        <h2 id="orgae5fc5f"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-01-27 Mo&gt;</span></span></h2>
        <div class="outline-text-2" id="text-orgae5fc5f">
          <p>
            Habe das parsen von equations mit klammern gefixt.
          </p>

          <p>
            commit hash: 4d26fbf
          </p>
        </div>
      </div>
      <div id="outline-container-org959229a" class="outline-2">
        <h2 id="org959229a"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-01-28 Di&gt;</span></span></h2>
        <div class="outline-text-2" id="text-org959229a">
          <p>
            Kleine Anpassung für einheitlicheren code.
            (In EquationNode.java state und value sind jetzt public)
          </p>

          <p>
            commit hash: a355644
          </p>
        </div>
      </div>
      <div id="outline-container-orgb1e654f" class="outline-2">
        <h2 id="orgb1e654f"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-01-30 Do&gt;</span></span></h2>
        <div class="outline-text-2" id="text-orgb1e654f">
          <p>
            Wieder Probleme mit klammern gefixt.
          </p>

          <p>
            commit hash: a838576
          </p>
        </div>
      </div>
      <div id="outline-container-org89af6a9" class="outline-2">
        <h2 id="org89af6a9"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-02-03 Mo&gt;</span></span></h2>
        <div class="outline-text-2" id="text-org89af6a9">
          <p>
            Überlegen wie special funktionen gehandelt werden sollen.
          </p>
        </div>
      </div>
      <div id="outline-container-org53af719" class="outline-2">
        <h2 id="org53af719"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-02-04 Di&gt;</span></span></h2>
        <div class="outline-text-2" id="text-org53af719">
          <p>
            Durchbruch mit operator stack.
            Anstatt nur auf lastOp limitiert zu sein werden die operatoren in einem Stack gespeichert, um besser auf sie zugreifen zu können.
          </p>

          <p>
            Habe auch angefangen die Zeit genauer zu loggen.
          </p>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-02-04 Di 21:21]&#x2013;[2025-02-04 Di 22:06] </span></span> =&gt;  0:45</li>
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-02-04 Di 11:28]&#x2013;[2025-02-04 Di 13:10] </span></span> =&gt;  1:42</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-org140569a" class="outline-2">
        <h2 id="org140569a"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-02-05 Mi&gt;</span></span></h2>
        <div class="outline-text-2" id="text-org140569a">
          <p>
            Fertigstellung der groben implementation vom Operator Stack.
          </p>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-02-05 Mi 11:27]&#x2013;[2025-02-05 Mi 13:05] </span></span> =&gt;  1:38</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-orgbfd7ab4" class="outline-2">
        <h2 id="orgbfd7ab4"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-02-06 Do&gt;</span></span></h2>
        <div class="outline-text-2" id="text-orgbfd7ab4">
          <p>
            Weiter an operator stack gearbeitet.
          </p>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-02-06 Do 11:26]&#x2013;[2025-02-06 Do 13:05] </span></span> =&gt;  1:39</li>
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-02-06 Do 08:45]&#x2013;[2025-02-06 Do 09:25] </span></span> =&gt;  0:40</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-orga2f2e7f" class="outline-2">
        <h2 id="orga2f2e7f"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-02-10 Mo&gt;</span></span></h2>
        <div class="outline-text-2" id="text-orga2f2e7f">
          <p>
            Weiter an operator stack gearbeitet.
          </p>
          <ul class="org-ul">
            <li>oplevel</li>
            <li>interactiveDemo</li>
          </ul>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-02-10 Mo 20:18]&#x2013;[2025-02-10 Mo 21:17] </span></span> =&gt;  0:59</li>
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-02-10 Mo 10:36]&#x2013;[2025-02-10 Mo 12:10] </span></span> =&gt;  1:34</li>
          </ul>
        </div>
      </div>
