Documentation (html)/Protokolle/nanids-protokoll.org
* <2025-02-11 Di>
Stack nicht mehr sortiert nach opLevel, sondern wie eingelesen.
Habe stattdessen die Ausgabe von lastOp angepasst.

*Arbeitszeit:*
- [2025-02-11 Di 17:54]--[2025-02-11 Di 18:30] =>  0:36
- [2025-02-11 Di 11:28]--[2025-02-11 Di 13:10] =>  1:42

* <2025-02-12 Mi>
Special funktionen funktionieren jetzt, der OperatorStack ist auch fertig.
Habe auch die 3 modi fertiggestellt:
- interactiveDemo (um interactive strings einzugeben)
- quickDebug (um einen String schnell zu testen)
- testParser (um viele Strings zu testen)

commit hash: 1db4ae3

*Arbeitszeit:*
- [2025-02-12 Mi 20:31]--[2025-02-12 Mi 21:44] =>  1:13
- [2025-02-12 Mi 17:04]--[2025-02-12 Mi 18:01] =>  0:57

* <2025-02-13 Do>
Habe OperatorStack add() doch noch einmal mit der sortierten variante umgeschrieben nur um dann zu merken, dass meine Idee doch nicht so funktioniert wie ich erhofft hatte.

*Arbeitszeit:*
- [2025-02-13 Do 09:34]--[2025-02-13 Do 10:18] =>  0:44
- [2025-02-13 Do 08:55]--[2025-02-13 Do 09:26] =>  0:31

* <2025-02-15 Sa>
Merged mit main und habe option hinzugefügt, das gui nicht zu launchen sondern stattdessen meine cli variante zu verwenden.
Sowie die option debug prints zu togglen.

commit hashes: 43f3638, 1319521, b681690

*Arbeitszeit:*
- [2025-02-15 Sa 18:30]--[2025-02-15 Sa 18:47] =>  0:17

* <2025-02-16 So>
Probleme mit negativen Zahlen gefixt.

commit hash: 625ff48

*Arbeitszeit:*
- [2025-02-16 So 15:32]--[2025-02-16 So 16:01] =>  0:29

* <2025-02-17 Mo>
An support für sqrt() sowie den special operatoren gearbeitet.

*Arbeitszeit:*
- [2025-02-17 Mo 10:42]--[2025-02-17 Mo 12:08] =>  1:26

* <2025-02-17 Di>
Implementierung für sqrt() und den special operatoren root() und log() fertiggestellt.

commit: 17f3540

* <2025-02-27 Do>
Merged main in meine branch und habe ein kleines Problem mit negativen Zahlen behoben.

Testen der neuen special Operatoren.

commit hash: 954c132

*Arbeitszeit:*
- [2025-02-27 Do 08:46]--[2025-02-27 Do 09:24] =>  0:38

* <2025-03-10 Mo>
Habe basic string sanitization hinzugefügt. (Alle Leerzeichen werden entfernt)
Und habe angefangen support für Konstanten (e pi) zu implementieren.

commit hash: da71f65

*Arbeitszeit:*
- [2025-03-10 Mo 10:46]--[2025-03-10 Mo 12:11] =>  1:25

* <2025-03-11 Di>
Die Konstanten e, pi und phi sind jetzt supported.
Habe ein kleineres Problem mit isFunction gefixt und nanid in main gemerged.

commit hashes: c6aa0ed, caa12ae, 22e9540, 917b8dc

*Arbeitszeit:*
- [2025-03-11 Di 11:30]--[2025-03-11 Di 13:10] =>  1:40

* <2025-03-13 Do>
Habe das parsen etwas getestet.

*Arbeitszeit:*
- [2025-03-13 Do 09:04]--[2025-03-13 Do 09:26] =>  0:22

* <2025-03-17 Mo>
Problem mit root() behoben.

commit hash: 3596d67

*Arbeitszeit:*
- [2025-03-17 Mo 12:11]--[2025-03-17 Mo 13:15] =>  1:04
- [2025-03-17 Mo 11:20]--[2025-03-17 Mo 12:10] =>  0:50

* <2025-03-18 Di>
Angefangen an Support für "unsichtbare" multiplikation zu arbeiten.
Zum Beispiel "2x" bedeutet eigentlich "2*x".

*Arbeitszeit:*
- [2025-03-18 Di 11:29]--[2025-03-18 Di 13:11] =>  1:42

* <2025-03-20 Do>
Support für "unsichtbare" multiplikation weitesgehend fertiggestellt.

commit hash: 8b000d6

*Arbeitszeit:*
- [2025-03-20 Do 08:43]--[2025-03-20 Do 09:25] =>  0:42

* <2025-03-23 Su>
Edgecase gefixt bei dem es hoch eine negative Zahl gibt, welche nicht eingeklammert ist.
Zum beispiel x^-1.

commit hash: 2f1c748

*Arbeitszeit:*
- [2025-03-23 Sun 19:15]--[2025-03-23 Sun 19:48] =>  0:33

