Documentation (html)/Protokolle/nanids-protokoll.html
      <div id="outline-container-orgd868677" class="outline-2">
        <h2 id="orgd868677"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-02-11 Di&gt;</span></span></h2>
        <div class="outline-text-2" id="text-orgd868677">
          <p>
            Stack nicht mehr sortiert nach opLevel, sondern wie eingelesen.
            Habe stattdessen die Ausgabe von lastOp angepasst.
          </p>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-02-11 Di 17:54]&#x2013;[2025-02-11 Di 18:30] </span></span> =&gt;  0:36</li>
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-02-11 Di 11:28]&#x2013;[2025-02-11 Di 13:10] </span></span> =&gt;  1:42</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-orgf0a1395" class="outline-2">
        <h2 id="orgf0a1395"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-02-12 Mi&gt;</span></span></h2>
        <div class="outline-text-2" id="text-orgf0a1395">
          <p>
            Special funktionen funktionieren jetzt, der OperatorStack ist auch fertig.
            Habe auch die 3 modi fertiggestellt:
          </p>
          <ul class="org-ul">
            <li>interactiveDemo (um interactive strings einzugeben)</li>
            <li>quickDebug (um einen String schnell zu testen)</li>
            <li>testParser (um viele Strings zu testen)</li>
          </ul>

          <p>
            commit hash: 1db4ae3
          </p>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-02-12 Mi 20:31]&#x2013;[2025-02-12 Mi 21:44] </span></span> =&gt;  1:13</li>
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-02-12 Mi 17:04]&#x2013;[2025-02-12 Mi 18:01] </span></span> =&gt;  0:57</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-org4fa1f38" class="outline-2">
        <h2 id="org4fa1f38"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-02-13 Do&gt;</span></span></h2>
        <div class="outline-text-2" id="text-org4fa1f38">
          <p>
            Habe OperatorStack add() doch noch einmal mit der sortierten variante umgeschrieben nur um dann zu merken, dass meine Idee doch nicht so funktioniert wie ich erhofft hatte.
          </p>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-02-13 Do 09:34]&#x2013;[2025-02-13 Do 10:18] </span></span> =&gt;  0:44</li>
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-02-13 Do 08:55]&#x2013;[2025-02-13 Do 09:26] </span></span> =&gt;  0:31</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-orgf0d94d3" class="outline-2">
        <h2 id="orgf0d94d3"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-02-15 Sa&gt;</span></span></h2>
        <div class="outline-text-2" id="text-orgf0d94d3">
          <p>
            Merged mit main und habe option hinzugefügt, das gui nicht zu launchen sondern stattdessen meine cli variante zu verwenden.
            Sowie die option debug prints zu togglen.
          </p>

          <p>
            commit hashes: 43f3638, 1319521, b681690
          </p>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-02-15 Sa 18:30]&#x2013;[2025-02-15 Sa 18:47] </span></span> =&gt;  0:17</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-org8a30b27" class="outline-2">
        <h2 id="org8a30b27"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-02-16 So&gt;</span></span></h2>
        <div class="outline-text-2" id="text-org8a30b27">
          <p>
            Probleme mit negativen Zahlen gefixt.
          </p>

          <p>
            commit hash: 625ff48
          </p>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-02-16 So 15:32]&#x2013;[2025-02-16 So 16:01] </span></span> =&gt;  0:29</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-orgcbc994f" class="outline-2">
        <h2 id="orgcbc994f"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-02-17 Mo&gt;</span></span></h2>
        <div class="outline-text-2" id="text-orgcbc994f">
          <p>
            An support für sqrt() sowie den special operatoren gearbeitet.
          </p>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-02-17 Mo 10:42]&#x2013;[2025-02-17 Mo 12:08] </span></span> =&gt;  1:26</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-org5d3fa9b" class="outline-2">
        <h2 id="org5d3fa9b"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-02-17 Mo&gt;</span></span></h2>
        <div class="outline-text-2" id="text-org5d3fa9b">
          <p>
            Implementierung für sqrt() und den special operatoren root() und log() fertiggestellt.
          </p>

          <p>
            commit: 17f3540
          </p>
        </div>
      </div>
      <div id="outline-container-org5e7f311" class="outline-2">
        <h2 id="org5e7f311"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-02-27 Do&gt;</span></span></h2>
        <div class="outline-text-2" id="text-org5e7f311">
          <p>
            Merged main in meine branch und habe ein kleines Problem mit negativen Zahlen behoben.
          </p>

          <p>
            Testen der neuen special Operatoren.
          </p>

          <p>
            commit hash: 954c132
          </p>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-02-27 Do 08:46]&#x2013;[2025-02-27 Do 09:24] </span></span> =&gt;  0:38</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-orge844423" class="outline-2">
        <h2 id="orge844423"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-03-10 Mo&gt;</span></span></h2>
        <div class="outline-text-2" id="text-orge844423">
          <p>
            Habe basic string sanitization hinzugefügt. (Alle Leerzeichen werden entfernt)
            Und habe angefangen support für Konstanten (e pi) zu implementieren.
          </p>

          <p>
            commit hash: da71f65
          </p>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-03-10 Mo 10:46]&#x2013;[2025-03-10 Mo 12:11] </span></span> =&gt;  1:25</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-org7dfdfb1" class="outline-2">
        <h2 id="org7dfdfb1"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-03-11 Di&gt;</span></span></h2>
        <div class="outline-text-2" id="text-org7dfdfb1">
          <p>
            Die Konstanten e, pi und phi sind jetzt supported.
            Habe ein kleineres Problem mit isFunction gefixt und nanid in main gemerged.
          </p>

          <p>
            commit hashes: c6aa0ed, caa12ae, 22e9540, 917b8dc
          </p>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-03-11 Di 11:30]&#x2013;[2025-03-11 Di 13:10] </span></span> =&gt;  1:40</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-org2c9256f" class="outline-2">
        <h2 id="org2c9256f"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-03-13 Do&gt;</span></span></h2>
        <div class="outline-text-2" id="text-org2c9256f">
          <p>
            Habe das parsen etwas getestet.
          </p>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-03-13 Do 09:04]&#x2013;[2025-03-13 Do 09:26] </span></span> =&gt;  0:22</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-org8a9007b" class="outline-2">
        <h2 id="org8a9007b"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-03-17 Mo&gt;</span></span></h2>
        <div class="outline-text-2" id="text-org8a9007b">
          <p>
            Problem mit root() behoben.
          </p>

          <p>
            commit hash: 3596d67
          </p>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-03-17 Mo 12:11]&#x2013;[2025-03-17 Mo 13:15] </span></span> =&gt;  1:04</li>
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-03-17 Mo 11:20]&#x2013;[2025-03-17 Mo 12:10] </span></span> =&gt;  0:50</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-org0fa17dc" class="outline-2">
        <h2 id="org0fa17dc"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-03-18 Di&gt;</span></span></h2>
        <div class="outline-text-2" id="text-org0fa17dc">
          <p>
            Angefangen an Support für &ldquo;unsichtbare&rdquo; multiplikation zu arbeiten.
            Zum Beispiel &ldquo;2x&rdquo; bedeutet eigentlich &ldquo;2*x&rdquo;.
          </p>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-03-18 Di 11:29]&#x2013;[2025-03-18 Di 13:11] </span></span> =&gt;  1:42</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-org1bbdaa9" class="outline-2">
        <h2 id="org1bbdaa9"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-03-20 Do&gt;</span></span></h2>
        <div class="outline-text-2" id="text-org1bbdaa9">
          <p>
            Support für &ldquo;unsichtbare&rdquo; multiplikation weitesgehend fertiggestellt.
          </p>

          <p>
            commit hash: 8b000d6
          </p>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-03-20 Do 08:43]&#x2013;[2025-03-20 Do 09:25] </span></span> =&gt;  0:42</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-orgd760c04" class="outline-2">
        <h2 id="orgd760c04"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-03-23 So&gt;</span></span></h2>
        <div class="outline-text-2" id="text-orgd760c04">
          <p>
            Edgecase gefixt bei dem es hoch eine negative Zahl gibt, welche nicht eingeklammert ist.
            Zum beispiel x<sup>-1</sup>.
          </p>

          <p>
            commit hash: 2f1c748
          </p>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-03-23 So 19:15]&#x2013;[2025-03-23 So 19:48] </span></span> =&gt;  0:33</li>
          </ul>
        </div>
      </div>
