Documentation (html)/Protokolle/nanids-protokoll.org
* <2025-03-24 Mo>
- Ordner restrukturiert.
- support für unicode varianten von Konstanten implementiert.
- support für special funktion abs() und mod (modulo) hinzugefügt.
- bug gefixt wenn y=0 geparsed wurde.

commit hashes: 5a2ad77, b654546, 8e7339f, ed18702

*Arbeitszeit:*
- [2025-03-24 Mo 10:33]--[2025-03-24 Mo 12:08] =>  1:35

* <2025-03-25 Di>
Java files in das directory JavaClasses/ gemoved.
Aracer06 branch in meine gemerged.
Habe auch angefangen an dem support für funktionen, welche bereits eingegeben worden sind zu arbeiten.

commit hashes: 662fdb3, a81b24c

*Arbeitszeit:*
- [2025-03-25 Di 11:30]--[2025-03-25 Di 12:12] =>  0:42
- [2025-03-25 Di 12:27]--[2025-03-25 Di 13:10] =>  0:43

* <2025-03-27 Do>
Invalide EquationTrees werden jetzt vor dem return in parseEquation() abgefangen. Das wird erreicht, indem werte im TwoDVec verändert werden, falls irgendetwas schief läuft in calculate().
Da das TwoDVec sich sonst nicht ändert, weiß man, dass der Baum invalide ist.

Der input string wird jetzt auch in all lowercase umgewandelt um probleme zu vermeiden.

commit hashes: 1d205bc, d503f44, 9373f48

*Arbeitszeit:*
- [2025-03-27 Do 08:40]--[2025-03-27 Do 09:24] =>  0:44

* <2025-03-31 Mo>
Support für existierende Funktionen ist jetzt fertiggestellt.
Zum beispiel f(x)=g(2x) wäre valider input, vorausgesetzt g(x) existiert.

Habe auch einen failsafe gegen das undendlich rekursive aufrufen von funktionen eingebaut.
Sodass, zum Beispiel f(x)=g(x)+2 mit g(x)=f(2), nicht zum Absturz führt.

commit hashes: b7219d8, 4eadd46, 1221400

*Arbeitszeit:*
- [2025-03-31 Mon 18:49]--[2025-03-31 Mon 21:01] =>  2:12
- [2025-03-31 Mo 10:37]--[2025-03-31 Mo 12:09] =>  1:32

* <2025-04-01 Di>
Bug gefixt bei dem f(x)=x als f(x)=x*x geparsed wurde und mit main gemerged.

Habe auch angefangen an einer Lösung für das Problem, wenn variablen vor special Funktion oder Operatoren stehen, zu arbeiten.

commit hashes: f64c11f, 4bff5fb

*Arbeitszeit:*
- [2025-04-01 Di 11:30]--[2025-04-01 Di 13:10] =>  1:40
- [2025-04-01 Di 09:28]--[2025-04-01 Di 09:50] =>  0:22

* <2025-04-02 Mi>
Habe support für variablen vor special Funktionen/Operatoren fertig implementiert.
Also "abcsin(x)" würde jetzt als "a*b*c*sin(x)" geparsed werden.

Fixed null pointer exception, wenn ein leerer special Operator, wie zum Beispiel "log(2,)", geparsed wird.

Habe auch einen design fehler in OperatorStack gefixt.
getLast() sollte jetzt das richtige returnen.

commit hashes: 1d6590c, 6ea575e

*Arbeitszeit:*
- [2025-04-02 Mi 19:45]--[2025-04-02 Mi 21:53] =>  2:08
- [2025-04-02 Mi 18:23]--[2025-04-02 Mi 18:51] =>  0:28

* <2025-04-03 Do>
Habe angefangen am Support für parametic Funktionen zu arbeiten

*Arbeitszeit:*
- [2025-04-03 Do 08:40]--[2025-04-03 Do 09:24] =>  0:44

* <2025-04-04 Fr>
Weiter am support für parametic Funktionen gearbeitet.

*Arbeitszeit:*
- [2025-04-04 Fr 18:51]--[2025-04-04 Fr 19:32] =>  0:41

* <2025-04-05 Sa>
Parametric Funktionen können jetzt geparsed werden.

commit hash: cf24f93

* <2025-04-07 Mo>
Probleme behoben die es beim parsen von parametic Funktionen gab.

Ersten support für condition trees implementiert.

commit hashes: 41c2d9e, ccc98e9

*Arbeitszeit:*
- [2025-04-07 Mo 16:35]--[2025-04-07 Mo 18:51] =>  2:16
- [2025-04-07 Mo 10:33]--[2025-04-07 Mo 12:10] =>  1:37

* <2025-04-08 Di>
Variablen welche durch invaliden input hinzugefügt wurden, werden jetzt automatisch entfernt.
Es wird ein backup von der variablen liste erstellt bevor der input geparsed wird, sodass dieser Zustand wiederhergestellt werden kann, im Fall von invalidem input.

Kleiner bug gefixt, bei dem "Φ" nicht als Konstante geparsed wurde.

commit hashes: 20821b8, 41997e5

*Arbeitszeit:*
- [2025-04-08 Di 19:26]--[2025-04-08 Di 20:34] =>  1:08
- [2025-04-08 Di 11:28]--[2025-04-08 Di 13:10] =>  1:42
- [2025-04-08 Di 09:56]--[2025-04-08 Di 10:17] =>  0:21

