Documentation (html)/Protokolle/nanids-protokoll.html
      <div id="outline-container-org870183f" class="outline-2">
        <h2 id="org870183f"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-03-24 Mo&gt;</span></span></h2>
        <div class="outline-text-2" id="text-org870183f">
          <ul class="org-ul">
            <li>Ordner restrukturiert.</li>
            <li>support für unicode varianten von Konstanten implementiert.</li>
            <li>support für special funktion abs() und mod (modulo) hinzugefügt.</li>
            <li>bug gefixt wenn y=0 geparsed wurde.</li>
          </ul>

          <p>
            commit hashes: 5a2ad77, b654546, 8e7339f, ed18702
          </p>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-03-24 Mo 10:33]&#x2013;[2025-03-24 Mo 12:08] </span></span> =&gt;  1:35</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-orgc453f8f" class="outline-2">
        <h2 id="orgc453f8f"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-03-25 Di&gt;</span></span></h2>
        <div class="outline-text-2" id="text-orgc453f8f">
          <p>
            Java files in das directory JavaClasses/ gemoved.
            Aracer06 branch in meine gemerged.
            Habe auch angefangen an dem support für funktionen, welche bereits eingegeben worden sind zu arbeiten.
          </p>

          <p>
            commit hashes: 662fdb3, a81b24c
          </p>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-03-25 Di 11:30]&#x2013;[2025-03-25 Di 12:12] </span></span> =&gt;  0:42</li>
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-03-25 Di 12:27]&#x2013;[2025-03-25 Di 13:10] </span></span> =&gt;  0:43</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-org7b85626" class="outline-2">
        <h2 id="org7b85626"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-03-27 Do&gt;</span></span></h2>
        <div class="outline-text-2" id="text-org7b85626">
          <p>
            Invalide EquationTrees werden jetzt vor dem return in parseEquation() abgefangen. Das wird erreicht, indem werte im TwoDVec verändert werden, falls irgendetwas schief läuft in calculate().
            Da das TwoDVec sich sonst nicht ändert, weiß man, dass der Baum invalide ist.
          </p>

          <p>
            Der input string wird jetzt auch in all lowercase umgewandelt um probleme zu vermeiden.
          </p>

          <p>
            commit hashes: 1d205bc, d503f44, 9373f48
          </p>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-03-27 Do 08:40]&#x2013;[2025-03-27 Do 09:24] </span></span> =&gt;  0:44</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-org6de799d" class="outline-2">
        <h2 id="org6de799d"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-03-31 Mo&gt;</span></span></h2>
        <div class="outline-text-2" id="text-org6de799d">
          <p>
            Support für existierende Funktionen ist jetzt fertiggestellt.
            Zum beispiel f(x)=g(2x) wäre valider input, vorausgesetzt g(x) existiert.
          </p>

          <p>
            Habe auch einen failsafe gegen das undendlich rekursive aufrufen von funktionen eingebaut.
            Sodass, zum Beispiel f(x)=g(x)+2 mit g(x)=f(2), nicht zum Absturz führt.
          </p>

          <p>
            commit hashes: b7219d8, 4eadd46, 1221400
          </p>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-03-31 Mo 18:49]&#x2013;[2025-03-31 Mo 21:01] </span></span> =&gt;  2:12</li>
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-03-31 Mo 10:37]&#x2013;[2025-03-31 Mo 12:09] </span></span> =&gt;  1:32</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-org13d105b" class="outline-2">
        <h2 id="org13d105b"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-01 Di&gt;</span></span></h2>
        <div class="outline-text-2" id="text-org13d105b">
          <p>
            Bug gefixt bei dem f(x)=x als f(x)=x*x geparsed wurde und mit main gemerged.
          </p>

          <p>
            Habe auch angefangen an einer Lösung für das Problem, wenn variablen vor special Funktion oder Operatoren stehen, zu arbeiten.
          </p>

          <p>
            commit hashes: f64c11f, 4bff5fb
          </p>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-04-01 Di 11:30]&#x2013;[2025-04-01 Di 13:10] </span></span> =&gt;  1:40</li>
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-04-01 Di 09:28]&#x2013;[2025-04-01 Di 09:50] </span></span> =&gt;  0:22</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-org45f4a4e" class="outline-2">
        <h2 id="org45f4a4e"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-02 Mi&gt;</span></span></h2>
        <div class="outline-text-2" id="text-org45f4a4e">
          <p>
            Habe support für variablen vor special Funktionen/Operatoren fertig implementiert.
            Also &ldquo;abcsin(x)&rdquo; würde jetzt als &ldquo;a*b*c*sin(x)&rdquo; geparsed werden.
          </p>

          <p>
            Fixed null pointer exception, wenn ein leerer special Operator, wie zum Beispiel &ldquo;log(2,)&rdquo;, geparsed wird.
          </p>

          <p>
            Habe auch einen design fehler in OperatorStack gefixt.
            getLast() sollte jetzt das richtige returnen.
          </p>

          <p>
            commit hashes: 1d6590c, 6ea575e
          </p>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-04-02 Mi 19:45]&#x2013;[2025-04-02 Mi 21:53] </span></span> =&gt;  2:08</li>
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-04-02 Mi 18:23]&#x2013;[2025-04-02 Mi 18:51] </span></span> =&gt;  0:28</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-orgcbd2e25" class="outline-2">
        <h2 id="orgcbd2e25"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-03 Do&gt;</span></span></h2>
        <div class="outline-text-2" id="text-orgcbd2e25">
          <p>
            Habe angefangen am Support für parametic Funktionen zu arbeiten
          </p>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-04-03 Do 08:40]&#x2013;[2025-04-03 Do 09:24] </span></span> =&gt;  0:44</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-orgec2b04f" class="outline-2">
        <h2 id="orgec2b04f"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-04 Fr&gt;</span></span></h2>
        <div class="outline-text-2" id="text-orgec2b04f">
          <p>
            Weiter am support für parametic Funktionen gearbeitet.
          </p>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-04-04 Fr 18:51]&#x2013;[2025-04-04 Fr 19:32] </span></span> =&gt;  0:41</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-org842ce5f" class="outline-2">
        <h2 id="org842ce5f"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-05 Sa&gt;</span></span></h2>
        <div class="outline-text-2" id="text-org842ce5f">
          <p>
            Parametric Funktionen können jetzt geparsed werden.
          </p>

          <p>
            commit hash: cf24f93
          </p>
        </div>
      </div>
      <div id="outline-container-orgc08b88a" class="outline-2">
        <h2 id="orgc08b88a"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-07 Mo&gt;</span></span></h2>
        <div class="outline-text-2" id="text-orgc08b88a">
          <p>
            Probleme behoben die es beim parsen von parametic Funktionen gab.
          </p>

          <p>
            Ersten support für condition trees implementiert.
          </p>

          <p>
            commit hashes: 41c2d9e, ccc98e9
          </p>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-04-07 Mo 16:35]&#x2013;[2025-04-07 Mo 18:51] </span></span> =&gt;  2:16</li>
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-04-07 Mo 10:33]&#x2013;[2025-04-07 Mo 12:10] </span></span> =&gt;  1:37</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-org7e0292c" class="outline-2">
        <h2 id="org7e0292c"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-08 Di&gt;</span></span></h2>
        <div class="outline-text-2" id="text-org7e0292c">
          <p>
            Variablen welche durch invaliden input hinzugefügt wurden, werden jetzt automatisch entfernt.
            Es wird ein backup von der variablen liste erstellt bevor der input geparsed wird, sodass dieser Zustand wiederhergestellt werden kann, im Fall von invalidem input.
          </p>

          <p>
            Kleiner bug gefixt, bei dem &ldquo;Φ&rdquo; nicht als Konstante geparsed wurde.
          </p>

          <p>
            commit hashes: 20821b8, 41997e5
          </p>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-04-08 Di 19:26]&#x2013;[2025-04-08 Di 20:34] </span></span> =&gt;  1:08</li>
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-04-08 Di 11:28]&#x2013;[2025-04-08 Di 13:10] </span></span> =&gt;  1:42</li>
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-04-08 Di 09:56]&#x2013;[2025-04-08 Di 10:17] </span></span> =&gt;  0:21</li>
          </ul>
        </div>
      </div>
