Documentation (html)/Protokolle/nanids-protokoll.org
* <2025-04-09 Mi>
Wieder ein Problem mit dem OperatorStack behoben. getLast() hatte nicht den richtigen Operator returned.

Habe das parsen von conditionen verbessert. Falls die condition am Anfang steht, wird diese nun nach hinten geschoben.

habe die MortySmiths Branch in meine gemerged und kleiner Probleme behoben.

commit hashes: 35b1bea, a23b018, 2f46506, 44667a5, 44f41cd

*Arbeitszeit:*
- [2025-04-09 Mi 16:57]--[2025-04-09 Mi 17:28] =>  0:31
- [2025-04-09 Mi 16:19]--[2025-04-09 Mi 16:48] =>  0:29
- [2025-04-09 Mi 15:05]--[2025-04-09 Mi 15:58] =>  0:53
- [2025-04-09 Mi 12:10]--[2025-04-09 Mi 13:25] =>  1:15

* <2025-04-10 Do>
Habe das parsen von parametric Funktionen verbessert.
Nullchecks hinzugefügt und die String manipulation etwas eleganter gemacht.

commit hash: 36b0810

*Arbeitszeit:*
- [2025-04-10 Do 10:00]--[2025-04-10 Do 11:30] =>  1:30

* <2025-04-12 Sa>
Habe main branch in meine gemerged und problem gefixt, bei dem die Funktion ihren Name verliert, wenn sie eine condition enthält.

Außerdem checks eingeführt für parametric Funktionen, dass die x bzw y definition nicht x oder y beinhalten darf.

commit hashes: 839d0ab, 294eabf, 9812d68

*Arbeitszeit:*
- [2025-04-12 Sat 18:39]--[2025-04-12 Sat 19:51] =>  1:12

* <2025-04-17 Do>
Programm getested, code kommentiert und etwas verbessert.

*Arbeitszeit:*
- [2025-04-17 Do 11:40]--[2025-04-17 Do 13:52] =>  2:12
- [2025-04-17 Do 07:41]--[2025-04-17 Do 08:12] =>  0:31

* <2025-04-19 Sa>
Weiter den Code kommentiert und "gesäubert".

*Arbeitszeit:*
- [2025-04-19 Sa 11:20]--[2025-04-19 Sa 11:38] =>  0:18
- [2025-04-19 Sa 10:42]--[2025-04-19 Sa 11:03] =>  0:21

* <2025-04-20 So>
Fertig mit dem kommentieren all meines Quellcodes geworden.

Habe gemerged und eine merge Konflikt behoben.

commit hashes: e0aa354, a01377b, 4a801c2, 17d6061

*Arbeitszeit:*
- [2025-04-20 So 16:48]--[2025-04-20 So 18:10] =>  1:22

* <2025-04-21 Mo>
Die ganze Dokumentation geschrieben.

commit hashes: 15e4b18, 9271490

*Arbeitszeit:*
- [2025-04-21 Mo 21:45]--[2025-04-21 Mo 22:10] =>  0:25
- [2025-04-21 Mo 17:36]--[2025-04-21 Mo 18:44] =>  1:08
- [2025-04-21 Mo 09:05]--[2025-04-21 Mo 11:24] =>  2:19

* <2025-04-24 Do>
Habe support für neuen syntax der condition nodes implementiert und ein problem beim parsen vom interval parametrischer funktionen gefixt.
Das interval darf nicht von "t" abhängen.

commit hashes: 72417ce, 705c392

*Arbeitszeit:*
- [2025-04-24 Do 20:46]--[2025-04-24 Do 22:05] =>  1:19
- [2025-04-24 Do 18:31]--[2025-04-24 Do 19:02] =>  0:31

* <2025-04-25 Fr>
Wenn etwas hinter der condition steht, ist es invalider input und wird dementsprechend gehandhabt.
Zum beispiel "x^2; if(y<9) 2x" würde nicht geparsed werden.

Edgecase in dem etwas, wie zum Beispiel "phi", vor einer parametrischen Funktion stand, wurde kein invalider Input gethrown.
Dies ist nun gefixt

Habe das auch noch in main gemerged.

commit hashes: 808c0cb, e613775, d221e5d, a93a07e


*Arbeitszeit:*
- [2025-04-25 Fr 12:26]--[2025-04-25 Fr 12:58] =>  0:32
- [2025-04-25 Fr 20:16]--[2025-04-25 Fr 20:33] =>  0:17
- [2025-04-25 Fr 20:56]--[2025-04-25 Fr 21:25] =>  0:29

* <2025-04-26 Sa>
Updated documentation.

Conditions after parametric functions now get parsed instead of throwing an error.

commit hashes: a93a07e, 0e7beed

*Arbeitszeit:*
- [2025-04-26 Sa 10:16]--[2025-04-26 Sa 10:59] =>  0:43
- [2025-04-26 Sa 08:22]--[2025-04-26 Sa 09:41] =>  1:19
