Documentation (html)/Protokolle/nanids-protokoll.html
      <div id="outline-container-org3ace078" class="outline-2">
        <h2 id="org3ace078"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-09 Mi&gt;</span></span></h2>
        <div class="outline-text-2" id="text-org3ace078">
          <p>
            Wieder ein Problem mit dem OperatorStack behoben. getLast() hatte nicht den richtigen Operator returned.
          </p>

          <p>
            Habe das parsen von conditionen verbessert. Falls die condition am Anfang steht, wird diese nun nach hinten geschoben.
          </p>

          <p>
            habe die MortySmiths Branch in meine gemerged und kleiner Probleme behoben.
          </p>

          <p>
            commit hashes: 35b1bea, a23b018, 2f46506, 44667a5, 44f41cd
          </p>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-04-09 Mi 16:57]&#x2013;[2025-04-09 Mi 17:28] </span></span> =&gt;  0:31</li>
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-04-09 Mi 16:19]&#x2013;[2025-04-09 Mi 16:48] </span></span> =&gt;  0:29</li>
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-04-09 Mi 15:05]&#x2013;[2025-04-09 Mi 15:58] </span></span> =&gt;  0:53</li>
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-04-09 Mi 12:10]&#x2013;[2025-04-09 Mi 13:25] </span></span> =&gt;  1:15</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-org16f54fd" class="outline-2">
        <h2 id="org16f54fd"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-10 Do&gt;</span></span></h2>
        <div class="outline-text-2" id="text-org16f54fd">
          <p>
            Habe das parsen von parametric Funktionen verbessert.
            Nullchecks hinzugefügt und die String manipulation etwas eleganter gemacht.
          </p>

          <p>
            commit hash: 36b0810
          </p>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-04-10 Do 10:00]&#x2013;[2025-04-10 Do 11:30] </span></span> =&gt;  1:30</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-org7f22f38" class="outline-2">
        <h2 id="org7f22f38"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-12 Sa&gt;</span></span></h2>
        <div class="outline-text-2" id="text-org7f22f38">
          <p>
            Habe main branch in meine gemerged und problem gefixt, bei dem die Funktion ihren Name verliert, wenn sie eine condition enthält.
          </p>

          <p>
            Außerdem checks eingeführt für parametric Funktionen, dass die x bzw y definition nicht x oder y beinhalten darf.
          </p>

          <p>
            commit hashes: 839d0ab, 294eabf, 9812d68
          </p>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-04-12 Sa 18:39]&#x2013;[2025-04-12 Sa 19:51] </span></span> =&gt;  1:12</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-org657407d" class="outline-2">
        <h2 id="org657407d"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-17 Do&gt;</span></span></h2>
        <div class="outline-text-2" id="text-org657407d">
          <p>
            Programm getested, code kommentiert und etwas verbessert.
          </p>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-04-17 Do 11:40]&#x2013;[2025-04-17 Do 13:52] </span></span> =&gt;  2:12</li>
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-04-17 Do 07:41]&#x2013;[2025-04-17 Do 08:12] </span></span> =&gt;  0:31</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-orgc373ad4" class="outline-2">
        <h2 id="orgc373ad4"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-19 Sa&gt;</span></span></h2>
        <div class="outline-text-2" id="text-orgc373ad4">
          <p>
            Weiter den Code kommentiert und &ldquo;gesäubert&rdquo;.
          </p>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-04-19 Sa 11:20]&#x2013;[2025-04-19 Sa 11:38] </span></span> =&gt;  0:18</li>
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-04-19 Sa 10:42]&#x2013;[2025-04-19 Sa 11:03] </span></span> =&gt;  0:21</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-orga18a575" class="outline-2">
        <h2 id="orga18a575"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-20 So&gt;</span></span></h2>
        <div class="outline-text-2" id="text-orga18a575">
          <p>
            Fertig mit dem kommentieren all meines Quellcodes geworden.
          </p>

          <p>
            Habe gemerged und eine merge Konflikt behoben.
          </p>

          <p>
            commit hashes: e0aa354, a01377b, 4a801c2, 17d6061
          </p>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-04-20 So 16:48]&#x2013;[2025-04-20 So 18:10] </span></span> =&gt;  1:22</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-org850eeed" class="outline-2">
        <h2 id="org850eeed"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-21 Mo&gt;</span></span></h2>
        <div class="outline-text-2" id="text-org850eeed">
          <p>
            Die ganze Dokumentation geschrieben.
          </p>

          <p>
            commit hashes: 15e4b18, 9271490
          </p>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-04-21 Mo 21:45]&#x2013;[2025-04-21 Mo 22:10] </span></span> =&gt;  0:25</li>
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-04-21 Mo 17:36]&#x2013;[2025-04-21 Mo 18:44] </span></span> =&gt;  1:08</li>
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-04-21 Mo 09:05]&#x2013;[2025-04-21 Mo 11:24] </span></span> =&gt;  2:19</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-org3e72437" class="outline-2">
        <h2 id="org3e72437"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-24 Do&gt;</span></span></h2>
        <div class="outline-text-2" id="text-org3e72437">
          <p>
            Habe support für neuen syntax der condition nodes implementiert und ein problem beim parsen vom interval parametrischer funktionen gefixt.
            Das interval darf nicht von &ldquo;t&rdquo; abhängen.
          </p>

          <p>
            commit hashes: 72417ce, 705c392
          </p>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-04-24 Do 20:46]&#x2013;[2025-04-24 Do 22:05] </span></span> =&gt;  1:19</li>
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-04-24 Do 18:31]&#x2013;[2025-04-24 Do 19:02] </span></span> =&gt;  0:31</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-org41efc81" class="outline-2">
        <h2 id="org41efc81"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-25 Fr&gt;</span></span></h2>
        <div class="outline-text-2" id="text-org41efc81">
          <p>
            Wenn etwas hinter der condition steht, ist es invalider input und wird dementsprechend gehandhabt.
            Zum beispiel &ldquo;x<sup>2</sup>; if(y&lt;9) 2x&rdquo; würde nicht geparsed werden.
          </p>

          <p>
            Edgecase in dem etwas, wie zum Beispiel &ldquo;phi&rdquo;, vor einer parametrischen Funktion stand, wurde kein invalider Input gethrown.
            Dies ist nun gefixt
          </p>

          <p>
            Habe das auch noch in main gemerged.
          </p>

          <p>
            commit hashes: 808c0cb, e613775, d221e5d, a93a07e
          </p>


          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-04-25 Fr 12:26]&#x2013;[2025-04-25 Fr 12:58] </span></span> =&gt;  0:32</li>
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-04-25 Fr 20:16]&#x2013;[2025-04-25 Fr 20:33] </span></span> =&gt;  0:17</li>
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-04-25 Fr 20:56]&#x2013;[2025-04-25 Fr 21:25] </span></span> =&gt;  0:29</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-orgb20fc81" class="outline-2">
        <h2 id="orgb20fc81"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-04-26 Sa&gt;</span></span></h2>
        <div class="outline-text-2" id="text-orgb20fc81">
          <p>
            Updated documentation.
          </p>

          <p>
            Conditions after parametric functions now get parsed instead of throwing an error.
          </p>

          <p>
            commit hashes: a93a07e, 0e7beed
          </p>

          <p>
            <b>Arbeitszeit:</b>
          </p>
          <ul class="org-ul">
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-04-26 Sa 10:16]&#x2013;[2025-04-26 Sa 10:59] </span></span> =&gt;  0:43</li>
            <li><span class="timestamp-wrapper"><span class="timestamp">[2025-04-26 Sa 08:22]&#x2013;[2025-04-26 Sa 09:41] </span></span> =&gt;  1:19</li>
          </ul>
        </div>
      </div>
    </div>
  </body>
</html>
